OdIfc.OdIfcEntity.subWorldDraw(OdGiWorldDraw*)
\details
Draws a graphical entity representation that is independent of any viewport context.
\param wd [in] A raw pointer to the object that encapsulates parameters of viewport-independent vectorization.
\returns Returns true if drawing was successful; otherwise, the method returns false.

OdIfc.OdIfcEntity.subSetAttributes(OdGiDrawableTraits*)
\details
Sets the values of the entity's sub-entity traits.
\param traits [out] A raw pointer to the traits to be filled and returned to a calling subroutine.
\returns Returns the result of setting the values.

OdIfc.OdIfcEntity.gsNode
\details
Retrieves the current Gs node object of the entity.
\returns Returns a raw pointer to the OdGsCache object associated with the entity.

OdIfc.OdIfcEntity.putAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns Returns true if the attribute value was successfully set; otherwise, the method returns false.

OdIfc.OdIfcEntity.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (the attribute value is not set).

OdIfc.OdIfcEntity.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdIfc.OdIfcEntity.isKindOf(OdIfc.OdIfcEntityType)
\details
Retrieves whether the entity belongs to a specified entity type.
\param entityType [in] An entity type.
\returns Returns true if the entity belongs to the specified type; otherwise, the method returns false.